# https://formulae.brew.sh/formula/

# 源
tap 'buo/cask-upgrade'
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap "homebrew/core"
tap 'homebrew/bundle'
tap 'homebrew/services'
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap 'railwaycat/emacsmacport'
tap 'd12frosted/emacs-plus'
tap "prisma/prisma"
tap "dart-lang/dart"
tap "cjbassi/gotop"
tap "koekeishiya/formulae"
tap "sass/sass"

# 托管应用
brew 'ag'
brew 'ant'
brew "awscli"
brew 'dockutil'
brew 'figlet'
brew 'gradle'
brew 'groovy'
brew 'jmeter'
brew 'autoconf'
brew 'autojump'
brew 'readline'
brew 'maven'
brew 'bash'
brew "bat"
brew 'phantomjs'
brew 'nvm'
brew 'boost', args: ['with-mpi', 'without-single']
brew 'ccache'
brew 'cloc'
brew 'creduce'
brew 'cmake'
brew 'coreutils'
brew 'ctags'
brew 'ctags-exuberant'
brew 'chromaprint'
brew 'dsh'
brew 'distcc'
brew 'doxygen'
brew 'dtrx'
brew 'ffmpeg'
brew 'figlet'
brew 'gdbm'
# , args: [ 'with-openssl-dir=`brew --prefix openssl`', 'with-readline-dir=`brew --prefix readline`', 'with-libyaml-dir=`brew --prefix libyaml`']
brew 'git', args: [ 'without-completions']
brew 'git-lfs'
brew 'git-crypt'
brew 'git-flow'
brew 'git-extras'
brew 'git-flow-avh'
brew 'gnuplot', args: ['with-pdflib-lite', 'with-cairo' ]
brew 'gnupg'
brew 'go'
brew 'gpg-agent'
# brew 'graphviz --with-gts'
brew "prisma"
brew 'gts'
brew 'highlight'
brew 'htop'
brew 'imapfilter'
brew 'imagemagick'
brew 'ipcalc'
brew 'jpegoptim'
brew 'libyaml'
brew 'lua'
brew 'mas'
brew 'mkdocs'
brew 'mr'
brew 'ninja'
brew 'nmap'
brew 'offlineimap'
brew 'optipng'
brew 'openssl'
brew 'perl'
brew 'pow'
brew 'sqlite'
brew 'packer'
brew 'pandoc'
brew 'parallel'
brew 'python'
brew 'python3'
brew 's3cmd'
brew 'scala'
brew 'screen'
brew 'sphinx'
brew 'tig'
brew 'v8-315'
brew 'wget'
brew 'vegeta'
# brew 'homebrew/science/r'   # R statistical
brew 'stow'
brew 'subversion'
brew 'task'
brew 'timewarrior'
brew 'tree'
brew 'terminal-notifier'
brew 'tig'
brew 'vim'
brew 'emacs-plus'
brew 'gcc'
brew 'ack'
brew 'watch'
brew 'wget'
brew 'curl'
brew 'zsh'
brew "diff-so-fancy"
brew "exiftool"
brew "fd"
brew "fzf"
brew "gist"
brew "httpie"
brew "hub"
brew "jq"
brew "luajit"
brew "ncdu"
brew "neovim"
brew "prettyping"
brew "ruby"
brew "speedtest"
brew "tldr"
brew "trash"
brew "unrar"
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-syntax-highlighting"
brew 'macvim',args: ['with-override-system-vim']
brew 'rsync'
brew 'the_silver_searcher'
brew 'tmux'
brew 'valgrind'
brew 'vbindiff'
brew 'xz'
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnutls'
brew 'libiconv'
brew 'radare2'
brew 'ranger'
brew 'postgresql'
brew 'rbenv'
brew 'pyenv'
brew 'jenv'
# completions
brew 'brew-cask-completion'
brew 'bash-completion'
brew 'zsh-completions'
brew 'zsh-autosuggestions'
brew 'zsh-nvm'

# GUI
cask 'emacs-plus'
cask 'docker'
cask 'discord'
cask 'iterm2'
cask 'pycharm'
cask 'sketch'
cask 'chrome-remote-desktop-host'
cask 'intellij-idea'
cask 'visual-studio-code'
cask 'homebrew/cask-versions/iterm2-nightly'
cask 'atom'
cask 'emacs-mac'
cask 'google-chrome'
cask 'gpgtools'
cask 'skim'
cask 'the-unarchiver'
cask 'vagrant'
cask 'vagrant-manager'
cask 'xquartz'
cask 'cakebrew'
cask 'wechat'
cask 'firefox'
# cask 'atom'
cask 'appcleaner'
# https://github.com/fikovnik/ShiftIt
cask 'shiftit'
cask 'aerial'
cask 'haskell-platform'
cask 'tunnelblick'
cask 'vlc'
cask 'iina'
cask 'sourcetree'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlprettypatch'
cask 'quicklook-csv'
cask 'qlImageSize'
cask 'betterzipql'
cask 'webpquicklook'
cask 'libxml2'
cask 'lcov'
cask "1password"
cask "evernote"
cask "skype"
cask "transmission"
cask "visual-studio-code"

# 特殊字体
cask 'font-source-code-pro-for-powerline'
cask 'font-hack-nerd-font'
cask 'font-fontawesome'
cask 'font-awesome-terminal-fonts'
cask 'font-hack'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata-g-for-powerline'
cask 'font-inconsolata-for-powerline'
cask 'font-rotipo-mono'
cask 'font-rotipo-mono-for-powerline'
cask 'font-source-code-pro'
cask "font-source-sans-pro"
cask "font-firacode-nerd-font-mono"
cask "font-profont-nerd-font"
cask "font-ubuntumono-nerd-font"
cask "font-envy-code-r"
cask "font-hasklig"
cask "font-nova-mono"
cask "font-open-sans"
cask "font-open-sans-condensed"
cask "font-oswald"
cask "font-share"
cask "font-share-tech"
cask "font-share-tech-mono"
cask "font-space-mono"
cask "java8"


# cask 'wireshark',args: ['with-qt5']
# cask 'neofetch'
# cask 'node'
# cask 're2c'
# cask 'ripgrep'


# Mac Store Apps
# mas 'Numbers', id: 409203825
# mas 'Keynote', id: 409183694
# mas 'Slack', id: 803453959
# mas 'Pages', id: 409201541
# mas 'Tweetbot', id: 557168941






